package _76_to_99_percent_solution;
/*
Йо-Йо 90%
https://www.e-olymp.com/uk/problems/421
*/
import java.util.Scanner;

public class Yo_Yo_421 {
    public static void main(String[] args) {
        Scanner input = new Scanner(System.in);
        int length = input.nextInt();
        int k = input.nextInt();

        int numbersLift = -1;

        for (double lengthAfterLift = length; lengthAfterLift > 1; lengthAfterLift = lengthAfterLift / k) {
            numbersLift += 1;
        }

        System.out.println(numbersLift);
    }
}
/*
Йо-йо
Іграшка йо-йо складається з катушки, на яку намотано нитку.
Якщо, тримаючи за кінець нитки, відпустити катушку, то вона буде, обертаючись, спочатку опускатись донизу,
а потім за інерцією підніматись вверх.
Але висота, на яку катушка підніметься, буде в k раз меншою, ніж висота, з якої вона опустилась.
Будемо вважати, що катушка зупинилась, якщо висота її чергового підйому не перевищує 1.

Напишіть програму, яка за довжиною нитки l та коефіцієнту k рахує кількість підйомів катушки до зупинки.
Наприклад, нехай l = 17, k = 2, тоді катушка буде підніматись на висоти 8.5, 4.25, 2.125, 1.0625, а потім зупиниться.
Таким чином будемо мати 4 підйоми.

Вхідні дані
Два цілих числа l (1  ≤l ≤  109) та k (2  ≤  k ≤  100).

Вихідні дані
Вивести одне число – кількість підйомів.

Вхідні дані #1
17 2
Вихідні дані #1
4
*/